# üö¢ Activity 1: Titanic Dataset ‚Äì Summary Statistics in EDA

In [6]:
import pandas as pd
import seaborn as sns
# Load the full Titanic dataset from seaborn for later analysis
titanic = sns.load_dataset('titanic')
#data = {
#    'age': [22, 38, 26, 35, 28, None, 54, 2, 27, 14],
#    'fare': [7.25, 71.83, 7.92, 53.10, 8.05, 8.46, 51.86, 21.08, 11.13, 30.07],
#    'pclass': [3, 1, 3, 1, 3, 3, 1, 3, 3, 2],
#    'sex': ['male', 'female', 'female', 'female', 'male', 'male', 'male', 'male', 'female', 'female'],
#    'embarked': ['S', 'C', 'S', 'S', 'S', 'Q', 'S', 'S', 'S', 'C'],
#    'class': ['Third', 'First', 'Third', 'First', 'Third', 'Third', 'First', 'Third', 'Third', 'Second']
#}
# Use the full Titanic dataset for analysis
df = pd.DataFrame(titanic)
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

## Step 1: Run `.describe()` and interpret

In [7]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

## Step 2: Compute mean, median, std for selected columns

In [8]:
df[['age', 'fare', 'pclass']].agg(['mean', 'median', 'std'])

              age       fare    pclass
mean    29.699118  32.204208  2.308642
median  28.000000  14.454200  3.000000
std     14.526497  49.693429  0.836071

## Step 3: Value counts for categorical columns

In [9]:
df['sex'].value_counts()

male      577
female    314
Name: sex, dtype: int64

In [10]:
df['embarked'].value_counts()

S    644
C    168
Q     77
Name: embarked, dtype: int64

In [11]:
df['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

## Step 4: Interpret the Output
Use the summary statistics to answer:
- What is the age distribution like?
- Is the fare distribution skewed?
- Which passenger class is most common?
- Which gender and port of embarkation are most frequent?

‚úçÔ∏è Write 2‚Äì3 key insights below.